fixed the ascii errors in the readme files
